"espk" = "Apple 揚聲器埠";
"ispk" = "內建";
"emic" = "麥克風埠";
"imic" = "內建";
"hdpn" = "耳機埠";
"lini" = "聲音 line in 埠";
"lino" = "聲音 line out 埠";
"spdi" = "數位光纖輸入埠";
"spdo" = "數位光纖輸出埠";
"pci " = "PCI 卡";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "網路設備";
"blue" = "Bluetooth";
"bluh" = "Bluetooth 耳機";
"blus" = "Bluetooth 耳機";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
